app/controllers/tasks_controller.rb

	def create
		@task = Task.new(:name => params[:task][:name])

		if @task.save
---
INSERT INTO "tasks" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-04 20:20:44.110640"], ["name", "Punch Yohan"], ["updated_at", "2014-10-04 20:20:44.110640"]]

	def update
		@task = Task.find(params[:id])
		@task.update_attribute(:status, true)
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = 6  [["status", "t"], ["updated_at", "2014-10-04 23:35:53.065577"]]