app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-06 00:35:12.903106"], ["email", "j@email.com"], ["name", "SDdSD"], ["password", "password"], ["updated_at", "2014-10-06 00:35:12.903106"]]
---
	def create
		@user = User.new(user_params)

		if @user.save