app/controllers/welcome_controller.rb

	def index
		@user = User.new
		@task = Task.new
		@tasks = Task.all
---
SELECT "tasks".* FROM "tasks"